Revit 2025 API
BackClippingParam Enumeration
 The allowed values for the VIEW_BACK_CLIPPING and VIEWER_BOUND_FAR_CLIPPING parameters.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum BackClippingParam
Public Enumeration BackClippingParam
public enum class BackClippingParam
type BackClippingParam
Members
Member name | Value | Description
NoClip | 0 |  No clip
ClipWithLine | 1 |  Clip with line.
ClipNoLine | 2 |  Clip without line.
See Also
Reference
Autodesk.Revit.DB Namespace